2019/javaee-servlet30-springmvc.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-05-11 周六 15:44 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Java EE - Servlet 3.0 和 Spring MVC</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">

<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/blog/misc/style.css">
<!-- Global site tag (gtag.js) - Google Analytics -->



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">Java EE - Servlet 3.0 和 Spring MVC</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc3e9957">1. 前言</a></li>
<li><a href="#orga232733">2. 基于 Java 的配置</a></li>
<li><a href="#org7225628">3. ServletContainerInitializer</a></li>
<li><a href="#org29a6513">4. 动态配置</a></li>
<li><a href="#orgac451d4">5. DispatcherServlet 和 ContextLoaderListener</a></li>
<li><a href="#org0e7d722">6. 两个应用上下文</a></li>
<li><a href="#org4d056b5">7. 配置过程</a></li>
<li><a href="#org37bf4df">8. 结语</a></li>
<li><a href="#orgbd4d4e5">9. 参考链接</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc3e9957" class="outline-2">
<h2 id="orgc3e9957"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
在学习 Spring MVC 的过程中发现，Spring MVC 使用了不少 Servlet 3.0 的新特性，但鉴于我学习 Servlet 使用的教程是 《Head First Servlet &amp; JSP》，
其中的 Servlet 版本只有 2.5，因此不得不去研究一下 Servlet 3.0 的新特性在继续 Spring MVC 的学习。
</p>

<p>
这篇博客的主要内容便是在学习了 Servlet 3.0 的一些新特性之后对 Spring MVC 的启动配置过程的理解。
</p>

<p>
注意：博客的主要内容不是关于 Servlet 3.0 的新特性和 Spring MVC 的使用的。
</p>

<details><summary><i></i></summary>

<p>
Servlet 3.0 规范 2009 年就出来了，但是现在的教程基本上还是从 web.xml 开始配置的……
</p>

</details>
</div>
</div>

<div id="outline-container-orga232733" class="outline-2">
<h2 id="orga232733"><span class="section-number-2">2</span> 基于 Java 的配置</h2>
<div class="outline-text-2" id="text-2">
<p>
首先我们来看一下一个基于 Java 的配置，其实就是《Spring 实战》第五章的那个配置：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">import</span> <span class="org-constant">org</span>.<span class="org-constant">springframework</span>.<span class="org-constant">web</span>.<span class="org-constant">servlet</span>.<span class="org-constant">support</span>.<span class="org-type">AbstractAnnotationConfigDispatcherServletInitializer</span>;

<span class="org-keyword">import</span> <span class="org-constant">spittr</span>.<span class="org-constant">web</span>.<span class="org-type">WebConfig</span>;

<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">SpitterWebInitializer</span> <span class="org-keyword">extends</span> <span class="org-type">AbstractAnnotationConfigDispatcherServletInitializer</span> {

  <span class="org-c-annotation">@Override</span>
  <span class="org-keyword">protected</span> <span class="org-type">Class</span>&lt;?&gt;[] <span class="org-function-name">getRootConfigClasses</span>() {
    <span class="org-keyword">return</span> <span class="org-keyword">new</span> <span class="org-type">Class</span>&lt;?&gt;[] { RootConfig.<span class="org-keyword">class</span> };
  }

  <span class="org-c-annotation">@Override</span>
  <span class="org-keyword">protected</span> <span class="org-type">Class</span>&lt;?&gt;[] <span class="org-function-name">getServletConfigClasses</span>() {
    <span class="org-keyword">return</span> <span class="org-keyword">new</span> <span class="org-type">Class</span>&lt;?&gt;[] { WebConfig.<span class="org-keyword">class</span> };
  }

  <span class="org-c-annotation">@Override</span>
  <span class="org-keyword">protected</span> <span class="org-type">String</span>[] <span class="org-function-name">getServletMappings</span>() {
    <span class="org-keyword">return</span> <span class="org-keyword">new</span> <span class="org-type">String</span>[] { <span class="org-string">"/"</span> };
  }
}
</pre>
</div>

<p>
这个配置的作用为：
</p>
<ol class="org-ol">
<li>配置 DispatcherServlet 的路径映射为 <code>/</code>, 也就是说所有的请求都会经由 DispatcherServlet 进行处理</li>
<li>指定 DispatcherServlet 中的应用上下文配置类为 WebConfig</li>
<li>指定 ContextLoaderListener 中的应用上下文配置类为 RootConfig</li>
</ol>

<p>
由于在看 《Head First Servlet &amp; JSP》的时候配置都是基于 XML 的，因此在看到《Spring 实战》的这一部分的时候我产生了不少的疑惑，其中包括：
</p>
<ol class="org-ol">
<li>DispatcherServlet 是什么？是我们自己编写的 Servlet 还是 Spring MVC 自带的？</li>
<li>ContextLoaderListener 是什么？新种类的 Listener？</li>
<li>我没有在 DD 中配置 DispatcherServlet，Servlet 容器怎么知道把请求发送给 DispatcherServlet？</li>
<li>Spring MVC 中存在两个应用上下文？</li>
<li>基于 XML 又该怎样配置？</li>
<li>……</li>
</ol>

<p>
这里面的一些问题可以通过看书解决，但有一些问题，还是需要查阅网上的资料才行。
</p>
</div>
</div>

<div id="outline-container-org7225628" class="outline-2">
<h2 id="org7225628"><span class="section-number-2">3</span> ServletContainerInitializer</h2>
<div class="outline-text-2" id="text-3">
<p>
Servlet 3.0 中的新特性还是不少的，其中一个新特性便是：
</p>
<ul class="org-ul">
<li>在 Servlet 3.0 环境中，Servlet 容器会在类路径中查找实现了 ServletContainerInitializer 接口的类，如果能发现的话，就会在启动的时候自动调用实现类的 onStartup 方法<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>。</li>
</ul>

<p>
Spring MVC 中的 ServletContainerInitializer 实现便是 SpringServletContainerInitializer，它的部分源码如下：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-c-annotation">@HandlesTypes</span>(WebApplicationInitializer.<span class="org-keyword">class</span>)
<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">SpringServletContainerInitializer</span> <span class="org-keyword">implements</span> <span class="org-type">ServletContainerInitializer</span> {

  <span class="org-c-annotation">@Override</span>
  <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">onStartup</span>(<span class="org-c-annotation">@Nullable</span> <span class="org-type">Set</span>&lt;<span class="org-type">Class</span>&lt;?&gt;&gt; <span class="org-variable-name">webAppInitializerClasses</span>, <span class="org-type">ServletContext</span> <span class="org-variable-name">servletContext</span>)
      <span class="org-keyword">throws</span> <span class="org-type">ServletException</span> {
    <span class="org-comment-delimiter">// </span><span class="org-comment">...</span>
  }
}
</pre>
</div>

<p>
onStartup 中的代码可以不用管，关键在于 SpringServletContainerInitializer 头上的那个注解：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-c-annotation">@HandlesTypes</span>(WebApplicationInitializer.<span class="org-keyword">class</span>)
</pre>
</div>

<p>
这个注解的意思是：初始化 SpringServletContainerInitializer 时扫描所有实现了 WebApplicationInitializer 接口的类，并作为参数 webAppInitializerClasses 传递给 onStartup 方法。
</p>

<p>
而我们在前面的配置中继承的 AbstractAnnotationConfigDispatcherServletInitializer 便是 WebApplicationInitializer 的一个便利的基础实现。
</p>

<p>
也就是说，Servlet 容器启动的时候会将我们的配置类发送给 SpringServletContainerInitializer 方法，然后在进行一系列的操作后完成 DispatcherServlet 的配置。
</p>

<p>
到了这里，大概能解决 Servlet 容器是怎么找到我们的配置类的，但还有一个问题是：Spring MVC 是怎么配置的 DispatcherServlet。
</p>
</div>
</div>

<div id="outline-container-org29a6513" class="outline-2">
<h2 id="org29a6513"><span class="section-number-2">4</span> 动态配置</h2>
<div class="outline-text-2" id="text-4">
<p>
Servlet 3.0 中的一个新特性便是支持动态配置，我们可以通过 ServletContext 获取 Registration 对象进行动态配置，比如：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-constant">ServletRegistration</span>.<span class="org-type">Dynamic</span> <span class="org-variable-name">registratio</span> = ServletContext.addServlet(<span class="org-string">"appServlet"</span>, DispatcherServlet.<span class="org-keyword">class</span>);
registratio.addMapping(<span class="org-string">"/"</span>);
</pre>
</div>

<p>
我们可以看到，SpringServletContainerInitializer 的 onStartup 是可以获得 ServletContext 的，因此，我们完全可以在 onStartup 内部完成 DispatcherServlet 的配置。
</p>

<p>
很好，Servlet 容器是怎么配置 DispatcherServlet 的问题大概可以解决了。
</p>
</div>
</div>

<div id="outline-container-orgac451d4" class="outline-2">
<h2 id="orgac451d4"><span class="section-number-2">5</span> DispatcherServlet 和 ContextLoaderListener</h2>
<div class="outline-text-2" id="text-5">
<p>
通过查阅资料可以发现，DispatcherServlet 是 Spring MVC 框架自带的 Servlet，而 ContextLoaderListener 是 Spring MVC 自带的 ServletContextListener，不是新品种的监听者。
</p>

<p>
这两个类的源码链接如下：
</p>
<ul class="org-ul">
<li><a href="https://github.com/spring-projects/spring-framework/blob/master/spring-web/src/main/java/org/springframework/web/context/ContextLoaderListener.java">spring-framework/ContextLoaderListener.java at master · spring-projects/spring-framework</a></li>
<li><a href="https://github.com/spring-projects/spring-framework/blob/master/spring-webmvc/src/main/java/org/springframework/web/servlet/DispatcherServlet.java">spring-framework/DispatcherServlet.java at master · spring-projects/spring-framework</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0e7d722" class="outline-2">
<h2 id="org0e7d722"><span class="section-number-2">6</span> 两个应用上下文</h2>
<div class="outline-text-2" id="text-6">
<p>
在最开始的配置中，我们分别制定了 DispatcherServlet 和 ContextLoaderListener 中的应用上下文的配置类，这意味着：
</p>
<ul class="org-ul">
<li>Spring MVC 中存在两个应用上下文，这两个应用上下文分别位于 DispatcherServlet 和 ContextLoaderListener</li>
</ul>

<p>
翻书可以得知，这两个应用上下文的作用分别为：
</p>
<ul class="org-ul">
<li>DispatcherServlet 应用上下文用于加载应用中包含 Web 组件的 Bean，包括控制器、视图解析器……</li>
<li>ContextLoaderListener 应用上下文用于加载应用中的其他 Bean，通常是驱动应用后端的中间层和数据层组件。</li>
</ul>

<p>
这样一来，我们便可以大致总结一下配置 DispatcherServlet 和 ContextLoaderListener 中需要配置的内容了：
</p>
<ul class="org-ul">
<li>DispatcherServlet：普通 Servlet 对象需要的配置项，如路径映射、初始化参数。以及内部的 Spring 应用上下文的配置</li>
<li>ContextLoaderListener：常规的应用上下文配置，比如初始化参数。以及内部的 Spring 应用上下文的配置。</li>
</ul>
</div>
</div>

<div id="outline-container-org4d056b5" class="outline-2">
<h2 id="org4d056b5"><span class="section-number-2">7</span> 配置过程</h2>
<div class="outline-text-2" id="text-7">
<p>
现在可以大致总结一下 Spring MVC 的配置过程了：
</p>
<ol class="org-ol">
<li>Servlet 容器启动的时候查找 ServletContainerInitializer 的实现类，找到 SpringServletContainerInitializer</li>
<li>根据 SpringServletContainerInitializer 的 HandlesTypes 查找所有 WebApplicationInitializer 的实现类</li>
<li>SpringServletContainerInitializer 的 onStartup 在内部的调用流程中创建并配置 DispatcherServlet 和 ContextLoaderListener</li>
</ol>

<p>
当然了，没有看源码的话，还有一个细节是不清楚的：
</p>
<ul class="org-ul">
<li>应用上下文的创建是在 DispatcherServlet 和 ContextLoaderListener 内部完成的还是在外部创建好后传递给 DispatcherServlet 和 ContextLoaderListener</li>
</ul>

<p>
当然了，这无伤大雅 （￣▽￣）
</p>

<details><summary><i></i></summary>

<p>
之前还一直在想 Servlet 容器是先调用 ServletContainerInitializer 还是先调用 ServletContextListener，然后突然反应过来，我都没有配置 Listener，
那肯定只能是 ServletContainerInitializer 了啊 (°∀°)ﾉ
</p>

</details>

<p>
更新：
</p>
<ul class="org-ul">
<li>2019.05.11 - 看了一下官方文档，两个应用上下文都是在创建好以后再分配给 DispatcherServlet 和 ContextLoaderListener 的，同时 DispatcherServlet 中的应用上下文是 ContextLoaderListener 的子应用上下文，
当 DispatcherServlet 中找不到需要的 Bean 时，就会委托给 ContextLoaderListener 应用上下文查找。</li>
</ul>
</div>
</div>

<div id="outline-container-org37bf4df" class="outline-2">
<h2 id="org37bf4df"><span class="section-number-2">8</span> 结语</h2>
<div class="outline-text-2" id="text-8">
<p>
本来还说贴一下 XML 的配置代码，结果《Spring 实战》提供的样例代码中直接把 web.xml 给去了，所以……
</p>
</div>
</div>

<div id="outline-container-orgbd4d4e5" class="outline-2">
<h2 id="orgbd4d4e5"><span class="section-number-2">9</span> 参考链接</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li><a href="https://elim.iteye.com/blog/2426592">通过 ServletContainerInitializer 注册 Servlet 对象 - Elim 的博客 - ITeye 博客</a></li>
<li><a href="http://www.oracle.com/technetwork/cn/community/4-servlet-3-324302-zhs.pdf">JavaEE 6 Servlet 3.0 中的新特性 - Oracle</a></li>
<li><a href="https://www.ibm.com/developerworks/cn/java/j-lo-servlet30/index.html">Servlet 3.0 新特性详解</a></li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">&#33050;&#27880;: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
书上这里说的是：如果能发现的话，就会用实现类来配置 Servlet 容器。感觉这种说法挺不准确的，不知道是不是翻译的锅。
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
版权声明：本作品采用<a rel="license" href="http://creativecommons.org/licenses/by-nc/4.0/">知识共享署名-非商业性使用 4.0 国际许可协议</a>进行许可
<div id="disqus_thread"></div>
<script type="text/javascript">
  var disqus_shortname = 'rgb-24bit';
  (function() {
    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
</script>
</div>
</body>
</html>
